In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt

In [2]:
# series example
# series is like single column of table. The series can be created by passing dictonary or array 
# array series
arrSe=[1,4,5,6,'tr']
series_array= pd.Series(arrSe)
series_array

0     1
1     4
2     5
3     6
4    tr
dtype: object

In [3]:
# the index should alsways match the number of items in array 
series_array2=pd.Series(arrSe,['one','two','three','four','five'])
series_array2

one       1
two       4
three     5
four      6
five     tr
dtype: object

In [4]:
# series with dictonary & name of series
dic_ser= {1:"we",2:"sdf",3:1}
series_dic=pd.Series(dic_ser,name="dic series")
series_dic

1     we
2    sdf
3      1
Name: dic series, dtype: object

In [5]:
# find out key(index)
print(1 in series_dic)
4 in series_array2

True

False

In [6]:
# data frame is like sql table
# with index as rows
# columns as columns
# from dic
dic_df = {1:'sa',2:'pu',3:'ay',4:'si'}
ind_dic=index=['a','b','c','d','e']
df_dic= pd.DataFrame(dic_df,index=ind_dic)
df_dic

    1   2   3   4
a  sa  pu  ay  si
b  sa  pu  ay  si
c  sa  pu  ay  si
d  sa  pu  ay  si
e  sa  pu  ay  si

In [7]:
# from numpy array
# rows id ( index)
dates_index = pd.date_range('20160101', periods=6)
# create colm values 
# create rnd number 6 rows 4 columns= 24 dataset
rnd_rows=np.random.randn(6,4)
# col names
name_col=['a','b','c','d']
df_dates =pd.DataFrame(rnd_rows, dates_index,name_col)
df_dates

                   a         b         c         d
2016-01-01 -0.673412 -1.125292 -1.037338  1.695370
2016-01-02  0.402166  0.583790 -0.269393 -0.502636
2016-01-03  0.112584 -0.656999  0.500654 -0.424287
2016-01-04 -0.179417  1.077664 -0.392456 -0.593880
2016-01-05 -0.139240 -0.047389  0.144753  1.586361
2016-01-06 -0.180086  0.580328  0.571401 -0.199207

In [8]:
# top 2
df_dates.head(2)

                   a         b         c         d
2016-01-01 -0.673412 -1.125292 -1.037338  1.695370
2016-01-02  0.402166  0.583790 -0.269393 -0.502636

In [9]:
# bottom 3
df_dates.tail(3)

                   a         b         c         d
2016-01-04 -0.179417  1.077664 -0.392456 -0.593880
2016-01-05 -0.139240 -0.047389  0.144753  1.586361
2016-01-06 -0.180086  0.580328  0.571401 -0.199207

In [10]:
# info about rows key(index)
df_dates.index
# info about columns
df_dates.columns

#info abt values
df_dates.values

array([[-0.67341151, -1.12529222, -1.03733776,  1.69537006],
       [ 0.40216583,  0.58378985, -0.26939276, -0.50263649],
       [ 0.1125842 , -0.6569994 ,  0.5006541 , -0.42428683],
       [-0.17941665,  1.07766434, -0.39245561, -0.59388   ],
       [-0.1392396 , -0.04738943,  0.14475304,  1.58636138],
       [-0.18008634,  0.58032846,  0.57140055, -0.19920702]])

In [11]:
# *** very imp****describe : used to see quick stat summary mean , median etc
df_dates.describe()

              a         b         c         d
count  6.000000  6.000000  6.000000  6.000000
mean  -0.109567  0.068684 -0.080396  0.260287
std    0.357736  0.837953  0.610244  1.077902
min   -0.673412 -1.125292 -1.037338 -0.593880
25%   -0.179919 -0.504597 -0.361690 -0.483049
50%   -0.159328  0.266470 -0.062320 -0.311747
75%    0.049628  0.582925  0.411679  1.139969
max    0.402166  1.077664  0.571401  1.695370

In [12]:
# transposing data frame
df_dates.T

   2016-01-01  2016-01-02  2016-01-03  2016-01-04  2016-01-05  2016-01-06
a   -0.673412    0.402166    0.112584   -0.179417   -0.139240   -0.180086
b   -1.125292    0.583790   -0.656999    1.077664   -0.047389    0.580328
c   -1.037338   -0.269393    0.500654   -0.392456    0.144753    0.571401
d    1.695370   -0.502636   -0.424287   -0.593880    1.586361   -0.199207

In [13]:
# sorting by index
df_dates.sort_index(axis=1,ascending=True)
# sorting by column, by =column name
df_dates.sort_values(by='c',ascending=False)

                   a         b         c         d
2016-01-06 -0.180086  0.580328  0.571401 -0.199207
2016-01-03  0.112584 -0.656999  0.500654 -0.424287
2016-01-05 -0.139240 -0.047389  0.144753  1.586361
2016-01-02  0.402166  0.583790 -0.269393 -0.502636
2016-01-04 -0.179417  1.077664 -0.392456 -0.593880
2016-01-01 -0.673412 -1.125292 -1.037338  1.695370

In [14]:
# selecting one column from data frame
df_dates.a
# or select by slicing row by [] 
#df_dates['b']

# slicing by row number as range from 1 to 3 (**not include***). so return row 1 and 2
df_dates[1:3]

# slcing by row unique or whatever present row range
df_dates['2016-01-03':'2016-02-04']

                   a         b         c         d
2016-01-03  0.112584 -0.656999  0.500654 -0.424287
2016-01-04 -0.179417  1.077664 -0.392456 -0.593880
2016-01-05 -0.139240 -0.047389  0.144753  1.586361
2016-01-06 -0.180086  0.580328  0.571401 -0.199207

In [15]:
# selecting by label (loc) selecting single row, all column
df_dates.loc['20160101']

a   -0.673412
b   -1.125292
c   -1.037338
d    1.695370
Name: 2016-01-01 00:00:00, dtype: float64

In [16]:
# selecting by label (loc) selecting all row, all row , slec column
df_dates.loc[:,['a','b']]

# selecting by label (loc) selecting particular row(*** both inclusive), all row , slec column
df_dates.loc['20160101':'20160103',['a','b']]


# selecting by label (loc) selecting 1 row , slec column
df_dates.loc['20160103',['a','b']]

a    0.112584
b   -0.656999
Name: 2016-01-03 00:00:00, dtype: float64

In [17]:

# selecting by label (loc) selecting particular row and column
df_dates.loc['20160101','a']

# **** selecting by at ( ** it is faster) selecting particular row and column
# error in running .look later
#df_dates.at[1,'b']

-0.67341150626216506

In [18]:
# select by position , selecting 1 row
df_dates.iloc[1]
# select by position , selecting range of rows (1:3) and col (2:5)
df_dates.iloc[1:3,2:5]
# select by position , selecting specific of rows (2,3,4) and col (1,2,3)
df_dates.iloc[[2,3,4],[1,2,3]]

# select by position , selecting all rows  and specific col 
df_dates.iloc[:,1:3]


# select by position , selecting all  col and specific  rows
df_dates.iloc[1:3,:]

# select by position , particlau col and row
#df_dates.iloc[1,3]

# select by position , usinh iat (** faster)
df_dates.iat[1,3]

-0.50263648510098968

In [19]:
# filtering using condition.** its like where in sql. using whole daat set
df_dates[df_dates>0]

# filtering using condition.** its like where in sql. using on column. 
df_dates[df_dates.c>0]

                   a         b         c         d
2016-01-03  0.112584 -0.656999  0.500654 -0.424287
2016-01-05 -0.139240 -0.047389  0.144753  1.586361
2016-01-06 -0.180086  0.580328  0.571401 -0.199207

In [20]:
df2=df_dates
df2['E'] = ['one', 'one','two','three','four','three']
# is in method
df2[df2['E'].isin(['two','four'])]

                   a         b         c         d     E
2016-01-03  0.112584 -0.656999  0.500654 -0.424287   two
2016-01-05 -0.139240 -0.047389  0.144753  1.586361  four

In [21]:
# setting value. check the number of entries matches number of rows
df2['f']=[1,2,3,4,5,6]

# setting value. using at with name
df2.at['2016-01-04','b']=123

# setting value. using iat with name
df2.iat[2,4]=456

In [22]:
# missing data 
# create new columns
#df2 =df_dates.copy()
df2=df_dates.reindex(index=[1,2,3,4], columns=list(df_dates.columns) + ['G'])
# set some value
#df2.loc[1:2,'a':'E']=1
df2.loc[1:2,:]=1

In [23]:
# drop na out . show onky rows wheer nocolumn in NA
#df2.dropna(how='any')
# fill values for NA. but seems only for display , not into real data frame
#df2.fillna(value='3')
# gives boolean outut for data frame for null value check 
df2.isnull()

       a      b      c      d      E      f      G
1  False  False  False  False  False  False  False
2  False  False  False  False  False  False  False
3   True   True   True   True   True   True   True
4   True   True   True   True   True   True   True

In [24]:
# stat opetion
df_dates.mean()
df_dates.mean(1)

2016-01-01    -0.028134
2016-01-02     0.442785
2016-01-03     0.506390
2016-01-04    25.166850
2016-01-05     1.308897
2016-01-06     1.354487
Freq: D, dtype: float64

In [33]:
#Applying function to data
#df2.apply(np.cumsum)
# applying lambda functionon data 
df2.apply(lambda x:x.mean()-x.max())

a    0.0
b    0.0
c    0.0
d    0.0
E    0.0
f    0.0
G    0.0
dtype: float64

In [34]:
# counting number of value lime group by and count in sql
df_dates.a.value_counts()

 0.112584    1
-0.673412    1
-0.180086    1
 0.402166    1
-0.179417    1
-0.139240    1
Name: a, dtype: int64

In [35]:
# string menthods
series_str =pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat','',' The course is ok'])

In [36]:
# all elemenet lower case
series_str.str.lower()

0                     a
1                     b
2                     c
3                  aaba
4                  baca
5                   NaN
6                  caba
7                   dog
8                   cat
9
10     the course is ok
dtype: object

In [37]:
# join in data frame
# make the data frame with commomh id value and 1 col different
dic_left= {'id':['a','a'],'lval':[1,2]}
left_df = pd.DataFrame(dic_left)
#dic_right= {'id':['a','a','b'],'lval':[11,12,13]}
dic_right= {'id':['a','a','a'],'lval':[11,12,13]}
right_df = pd.DataFrame(dic_right)
right_df

  id  lval
0  a    11
1  a    12
2  a    13

In [38]:
# merge the tables. see the diff in below output. above change right to see diff how only commong key gets merged
#pd.merge(left_df,right_df,on='id')
#pd.merge(right_df,left_df,on='id')
# another way to merge
right_df.merge(left_df,on='id')

  id  lval_x  lval_y
0  a      11       1
1  a      11       2
2  a      12       1
3  a      12       2
4  a      13       1
5  a      13       2

In [39]:
# concat the new row in the data frame
df3=df_dates.copy()
#newrow = {'2017-01-01': np.random.randn(1,4)}
newrow = pd.Series({'2017-01-01': np.random.randn(1,4)})
# ignore_indes is very important
df3.append(newrow,ignore_index=True)
df3

                   a           b         c         d      E  f
2016-01-01 -0.673412   -1.125292 -1.037338  1.695370    one  1
2016-01-02  0.402166    0.583790 -0.269393 -0.502636    one  2
2016-01-03  0.112584   -0.656999  0.500654 -0.424287    456  3
2016-01-04 -0.179417  123.000000 -0.392456 -0.593880  three  4
2016-01-05 -0.139240   -0.047389  0.144753  1.586361   four  5
2016-01-06 -0.180086    0.580328  0.571401 -0.199207  three  6

In [40]:
# GROUPING OF DATA FRAME ** VERY IMPORTANT
df_grp=  pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                       'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                       'C' : np.random.randn(8),
                       'D' : np.random.randn(8)})
# sum by col like sql group by A , sum C & D only **** may be B is text so no sum
#df_grp.groupby('A').sum()

# sum by col like sql group by A and B and sum C & D 
#df_grp.groupby(['A','B']).sum()
# group by A and B for C only 
df_grp.groupby(['A','B'])['C'].sum()

A    B
bar  one     -0.528042
     three   -0.508842
     two     -0.650807
foo  one      0.341852
     three    0.441233
     two     -1.483849
Name: C, dtype: float64

In [41]:
# stack
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz','foo', 'foo', 'qux', 'qux'],
   ['one', 'two', 'one', 'two','one', 'two', 'one', 'two']]))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one    -0.316948  0.753970
      two     1.459891 -1.669469
baz   one    -0.594116 -0.639254
      two     0.639038 -0.169983
foo   one    -1.170811 -0.773663
      two     0.183803 -0.258516
qux   one    -0.952416 -0.841561
      two     0.416598 -1.479962

In [42]:
# convert column value in row ...?
stacked=df.stack()
stacked
# un stack as dataframe again
#unstacked = stacked.unstack()
#unstacked

first  second
bar    one     A   -0.316948
               B    0.753970
       two     A    1.459891
               B   -1.669469
baz    one     A   -0.594116
               B   -0.639254
       two     A    0.639038
               B   -0.169983
foo    one     A   -1.170811
               B   -0.773663
       two     A    0.183803
               B   -0.258516
qux    one     A   -0.952416
               B   -0.841561
       two     A    0.416598
               B   -1.479962
dtype: float64

In [43]:
# pivot table , first is name of data froame, values is column to pivot, index=row label in excel, columns in column label of excel
pd.pivot_table(df_grp,values='C',index=['A'],columns=['B'])
#df_grp

B         one     three       two
A
bar -0.528042 -0.508842 -0.650807
foo  0.170926  0.441233 -0.741924

In [44]:
# time range, start date , period count and freq= type of period , S is seconds, D is day, M is month
trng = pd.date_range('1/1/2012', periods=100, freq='S')
# sample create series
ts = pd.Series(np.random.randint(0, 500, len(trng)), index=trng)
ts.resample('10min').sum()

2012-01-01    25207
Freq: 10T, dtype: int32

In [45]:
# category. make category 
df_category = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})
df_category
# making category d
d= df_category["raw_grade"].astype('category')
#d= df_category["id"].astype('category')
# assign category some values
d.cat.categories=['very good','good','bad']
# assign more cat values
d.cat.set_categories(["very bad", "bad", "medium", "good", "very good"])
#print(d)

# putting category in data frame
df_category['catval']=d

# sort by category
df_category.sort_values('catval')

# group y category
df_category.groupby('catval').sum()

           id
catval
very good  10
good        5
bad         6

In [46]:
#pd.date_range.__doc__
#help(pd.date_range)
#help(np.random.rand)